; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=141, out_folder=./training, instance_id=7, seed=2031, goal_proportion=0.03

(define (problem blocksworld-07)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 - object)
 (:init 
    (arm-empty)
    (clear b63)
    (on b63 b139)
    (on-table b139)
    (clear b78)
    (on b78 b138)
    (on b138 b37)
    (on-table b37)
    (clear b9)
    (on b9 b115)
    (on b115 b19)
    (on b19 b96)
    (on b96 b80)
    (on b80 b141)
    (on-table b141)
    (clear b84)
    (on b84 b15)
    (on b15 b88)
    (on b88 b90)
    (on b90 b70)
    (on b70 b137)
    (on b137 b66)
    (on b66 b59)
    (on b59 b4)
    (on-table b4)
    (clear b89)
    (on b89 b129)
    (on b129 b81)
    (on b81 b58)
    (on b58 b100)
    (on b100 b52)
    (on b52 b21)
    (on b21 b38)
    (on-table b38)
    (clear b97)
    (on b97 b20)
    (on-table b20)
    (clear b79)
    (on b79 b17)
    (on b17 b41)
    (on b41 b126)
    (on-table b126)
    (clear b68)
    (on b68 b135)
    (on-table b135)
    (clear b33)
    (on b33 b14)
    (on b14 b34)
    (on b34 b92)
    (on-table b92)
    (clear b60)
    (on b60 b99)
    (on b99 b13)
    (on-table b13)
    (clear b42)
    (on b42 b101)
    (on b101 b10)
    (on-table b10)
    (clear b32)
    (on b32 b122)
    (on b122 b83)
    (on b83 b24)
    (on b24 b134)
    (on b134 b23)
    (on b23 b64)
    (on b64 b131)
    (on b131 b45)
    (on b45 b108)
    (on-table b108)
    (clear b7)
    (on b7 b109)
    (on b109 b5)
    (on b5 b113)
    (on b113 b105)
    (on-table b105)
    (clear b116)
    (on b116 b69)
    (on b69 b27)
    (on b27 b119)
    (on b119 b25)
    (on-table b25)
    (clear b98)
    (on b98 b127)
    (on-table b127)
    (clear b125)
    (on b125 b47)
    (on b47 b11)
    (on b11 b62)
    (on-table b62)
    (clear b61)
    (on b61 b110)
    (on b110 b133)
    (on b133 b124)
    (on b124 b29)
    (on b29 b39)
    (on b39 b136)
    (on b136 b77)
    (on b77 b82)
    (on b82 b40)
    (on b40 b140)
    (on-table b140)
    (clear b86)
    (on b86 b120)
    (on b120 b75)
    (on-table b75)
    (clear b102)
    (on-table b102)
    (clear b106)
    (on b106 b1)
    (on b1 b49)
    (on b49 b67)
    (on b67 b72)
    (on b72 b65)
    (on b65 b76)
    (on b76 b31)
    (on b31 b74)
    (on b74 b91)
    (on b91 b130)
    (on b130 b3)
    (on b3 b12)
    (on-table b12)
    (clear b2)
    (on b2 b117)
    (on b117 b128)
    (on b128 b104)
    (on-table b104)
    (clear b107)
    (on-table b107)
    (clear b93)
    (on b93 b121)
    (on-table b121)
    (clear b22)
    (on b22 b111)
    (on-table b111)
    (clear b28)
    (on-table b28)
    (clear b44)
    (on b44 b112)
    (on b112 b16)
    (on b16 b94)
    (on-table b94)
    (clear b36)
    (on b36 b55)
    (on-table b55)
    (clear b30)
    (on-table b30)
    (clear b56)
    (on b56 b54)
    (on b54 b6)
    (on b6 b48)
    (on b48 b132)
    (on-table b132)
    (clear b26)
    (on b26 b35)
    (on-table b35)
    (clear b8)
    (on b8 b53)
    (on-table b53)
    (clear b87)
    (on b87 b50)
    (on b50 b43)
    (on-table b43)
    (clear b18)
    (on b18 b103)
    (on b103 b73)
    (on b73 b123)
    (on b123 b57)
    (on-table b57)
    (clear b51)
    (on b51 b114)
    (on-table b114)
    (clear b118)
    (on b118 b71)
    (on b71 b95)
    (on b95 b85)
    (on b85 b46)
    (on-table b46))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b4)
    (on-table b4)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b106 b1)
   deleted: (on b106 b1) (clear b106) (arm-empty)
   added: (holding b106) (clear b1)
   goals met: 2 of 6
2. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 2 of 6
3. (unstack b84 b15)
   deleted: (on b84 b15) (clear b84) (arm-empty)
   added: (holding b84) (clear b15)
   goals met: 2 of 6
4. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 2 of 6
5. (unstack b15 b88)
   deleted: (on b15 b88) (clear b15) (arm-empty)
   added: (holding b15) (clear b88)
   goals met: 2 of 6
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 6
7. (unstack b88 b90)
   deleted: (on b88 b90) (clear b88) (arm-empty)
   added: (holding b88) (clear b90)
   goals met: 2 of 6
8. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 2 of 6
9. (unstack b90 b70)
   deleted: (on b90 b70) (clear b90) (arm-empty)
   added: (holding b90) (clear b70)
   goals met: 2 of 6
10. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 2 of 6
11. (unstack b70 b137)
   deleted: (on b70 b137) (clear b70) (arm-empty)
   added: (holding b70) (clear b137)
   goals met: 2 of 6
12. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 2 of 6
13. (unstack b137 b66)
   deleted: (on b137 b66) (clear b137) (arm-empty)
   added: (holding b137) (clear b66)
   goals met: 2 of 6
14. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 2 of 6
15. (unstack b66 b59)
   deleted: (on b66 b59) (clear b66) (arm-empty)
   added: (holding b66) (clear b59)
   goals met: 2 of 6
16. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 6
17. (unstack b59 b4)
   deleted: (on b59 b4) (clear b59) (arm-empty)
   added: (holding b59) (clear b4)
   goals met: 2 of 6
18. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 2 of 6
19. (unstack b1 b49)
   deleted: (on b1 b49) (clear b1) (arm-empty)
   added: (holding b1) (clear b49)
   goals met: 1 of 6
20. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 3 of 6
21. (unstack b49 b67)
   deleted: (on b49 b67) (clear b49) (arm-empty)
   added: (holding b49) (clear b67)
   goals met: 3 of 6
22. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 3 of 6
23. (unstack b67 b72)
   deleted: (on b67 b72) (clear b67) (arm-empty)
   added: (holding b67) (clear b72)
   goals met: 3 of 6
24. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 3 of 6
25. (unstack b72 b65)
   deleted: (on b72 b65) (clear b72) (arm-empty)
   added: (holding b72) (clear b65)
   goals met: 3 of 6
26. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 3 of 6
27. (unstack b65 b76)
   deleted: (on b65 b76) (clear b65) (arm-empty)
   added: (holding b65) (clear b76)
   goals met: 3 of 6
28. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 3 of 6
29. (unstack b76 b31)
   deleted: (on b76 b31) (clear b76) (arm-empty)
   added: (holding b76) (clear b31)
   goals met: 3 of 6
30. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 3 of 6
31. (unstack b31 b74)
   deleted: (on b31 b74) (clear b31) (arm-empty)
   added: (holding b31) (clear b74)
   goals met: 3 of 6
32. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 6
33. (unstack b74 b91)
   deleted: (on b74 b91) (clear b74) (arm-empty)
   added: (holding b74) (clear b91)
   goals met: 3 of 6
34. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 3 of 6
35. (unstack b91 b130)
   deleted: (on b91 b130) (clear b91) (arm-empty)
   added: (holding b91) (clear b130)
   goals met: 3 of 6
36. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 3 of 6
37. (unstack b130 b3)
   deleted: (on b130 b3) (clear b130) (arm-empty)
   added: (holding b130) (clear b3)
   goals met: 4 of 6
38. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 4 of 6
39. (unstack b3 b12)
   deleted: (on b3 b12) (clear b3) (arm-empty)
   added: (holding b3) (clear b12)
   goals met: 3 of 6
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 5 of 6
41. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 3 of 6
42. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 6
43. (unstack b2 b117)
   deleted: (on b2 b117) (clear b2) (arm-empty)
   added: (holding b2) (clear b117)
   goals met: 4 of 6
44. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 6
45. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 4 of 6
46. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 6
